
import prototype from './Wither.png';

import portfolio from './portfolioWeb.mp4';
import chatApp from './chatApp.mp4';
import quickblog from './quickblog.mp4';
import auth from './auth.mp4';

import auth_logo from './favicon-auth.svg'
import quickblog_logo from './favicon-quickblog.svg'
import quickchat_logo from './favicon-quickchat.svg'

var facebook_logo = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" viewBox="0 0 24 24"><path fill="#69D9FE" d="M22 12c0-5.52-4.48-10-10-10S2 6.48 2 12c0 4.84 3.44 8.87 8 9.8V15H8v-3h2V9.5C10 7.57 11.57 6 13.5 6H16v3h-2c-.55 0-1 .45-1 1v2h3v3h-3v6.95c5.05-.5 9-4.76 9-9.95"/></svg>`;
var github_logo = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" viewBox="0 0 24 24"><path fill="#69D9FE" d="M12 2A10 10 0 0 0 2 12c0 4.42 2.87 8.17 6.84 9.5c.5.08.66-.23.66-.5v-1.69c-2.77.6-3.36-1.34-3.36-1.34c-.46-1.16-1.11-1.47-1.11-1.47c-.91-.62.07-.6.07-.6c1 .07 1.53 1.03 1.53 1.03c.87 1.52 2.34 1.07 2.91.83c.09-.65.35-1.09.63-1.34c-2.22-.25-4.55-1.11-4.55-4.92c0-1.11.38-2 1.03-2.71c-.1-.25-.45-1.29.1-2.64c0 0 .84-.27 2.75 1.02c.79-.22 1.65-.33 2.5-.33s1.71.11 2.5.33c1.91-1.29 2.75-1.02 2.75-1.02c.55 1.35.2 2.39.1 2.64c.65.71 1.03 1.6 1.03 2.71c0 3.82-2.34 4.66-4.57 4.91c.36.31.69.92.69 1.85V21c0 .27.16.59.67.5C19.14 20.16 22 16.42 22 12A10 10 0 0 0 12 2"/></svg>`;
var link_logo = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" viewBox="0 0 24 24"><path fill="#69D9FE" d="M7 17q-2.075 0-3.537-1.463T2 12t1.463-3.537T7 7h3q.425 0 .713.288T11 8t-.288.713T10 9H7q-1.25 0-2.125.875T4 12t.875 2.125T7 15h3q.425 0 .713.288T11 16t-.288.713T10 17zm2-4q-.425 0-.712-.288T8 12t.288-.712T9 11h6q.425 0 .713.288T16 12t-.288.713T15 13zm5 4q-.425 0-.712-.288T13 16t.288-.712T14 15h3q1.25 0 2.125-.875T20 12t-.875-2.125T17 9h-3q-.425 0-.712-.288T13 8t.288-.712T14 7h3q2.075 0 3.538 1.463T22 12t-1.463 3.538T17 17z"/></svg>`;
var link_arrow_logo = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" viewBox="0 0 24 24"><path fill="none" stroke="#69D9FE" stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M15 3h6v6m-11 5L21 3m-3 10v6a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2V8a2 2 0 0 1 2-2h6"/></svg>`;

var html = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 361"><path fill="#e44d26" d="m255.555 70.766l-23.241 260.36l-104.47 28.962l-104.182-28.922L.445 70.766z"/><path fill="#f16529" d="m128 337.95l84.417-23.403l19.86-222.49H128z"/><path fill="#ebebeb" d="M82.82 155.932H128v-31.937H47.917l.764 8.568l7.85 88.01H128v-31.937H85.739zm7.198 80.61h-32.06l4.474 50.146l65.421 18.16l.147-.04V271.58l-.14.037l-35.568-9.604z"/><path fill="#ffffff" d="M24.18 0h16.23v16.035h14.847V0h16.231v48.558h-16.23v-16.26H40.411v16.26h-16.23V0M92.83 16.103H78.544V0h44.814v16.103h-14.295v32.455h-16.23V16.103zM130.47 0h16.923l10.41 17.062L168.203 0h16.93v48.558h-16.164V24.49l-11.166 17.265h-.28L146.35 24.49v24.068h-15.88zm62.74 0h16.235v32.508h22.824v16.05h-39.06z"/><path fill="#fff" d="M127.89 220.573h39.327l-3.708 41.42l-35.62 9.614v33.226l65.473-18.145l.48-5.396l7.506-84.08l.779-8.576H127.89zm0-64.719v.078h77.143l.64-7.178l1.456-16.191l.763-8.568H127.89z"/></svg>`;
var css = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><path fill="#fff" d="M89.234 5.856H81.85l7.679 8.333v3.967H73.713v-4.645h7.678l-7.678-8.333V1.207h15.521zm-18.657 0h-7.384l7.679 8.333v3.967H55.055v-4.645h7.679l-7.679-8.333V1.207h15.522zm-18.474.19h-7.968v7.271h7.968v4.839H38.471V1.207h13.632z"/><path fill="#1572b6" d="m27.613 116.706l-8.097-90.813h88.967l-8.104 90.798l-36.434 10.102z"/><path fill="#33a9dc" d="m64.001 119.072l29.439-8.162l6.926-77.591H64.001z"/><path fill="#fff" d="M64 66.22h14.738l1.019-11.405H64V43.677h27.929l-.267 2.988l-2.737 30.692H64z"/><path fill="#ebebeb" d="m64.067 95.146l-.049.014l-12.404-3.35l-.794-8.883H39.641l1.561 17.488l22.814 6.333l.052-.015V95.146z"/><path fill="#fff" d="M77.792 76.886L76.45 91.802l-12.422 3.353v11.588l22.833-6.328l.168-1.882l1.938-21.647z"/><path fill="#ebebeb" d="M64.039 43.677v11.137H37.136l-.224-2.503l-.507-5.646l-.267-2.988zM64 66.221v11.138H51.753l-.223-2.503l-.508-5.647l-.267-2.988z"/></svg>`;
var javaScript = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 256"><path fill="#f7df1e" d="M0 0h256v256H0z"/><path d="m67.312 213.932l19.59-11.856c3.78 6.701 7.218 12.371 15.465 12.371c7.905 0 12.89-3.092 12.89-15.12v-81.798h24.057v82.138c0 24.917-14.606 36.259-35.916 36.259c-19.245 0-30.416-9.967-36.087-21.996m85.07-2.576l19.588-11.341c5.157 8.421 11.859 14.607 23.715 14.607c9.969 0 16.325-4.984 16.325-11.858c0-8.248-6.53-11.17-17.528-15.98l-6.013-2.58c-17.357-7.387-28.87-16.667-28.87-36.257c0-18.044 13.747-31.792 35.228-31.792c15.294 0 26.292 5.328 34.196 19.247l-18.732 12.03c-4.125-7.389-8.591-10.31-15.465-10.31c-7.046 0-11.514 4.468-11.514 10.31c0 7.217 4.468 10.14 14.778 14.608l6.014 2.577c20.45 8.765 31.963 17.7 31.963 37.804c0 21.654-17.012 33.51-39.867 33.51c-22.339 0-36.774-10.654-43.819-24.574"/></svg>`;
var react = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 228"><path fill="#00d8ff" d="M210.483 73.824a172 172 0 0 0-8.24-2.597c.465-1.9.893-3.777 1.273-5.621c6.238-30.281 2.16-54.676-11.769-62.708c-13.355-7.7-35.196.329-57.254 19.526a171 171 0 0 0-6.375 5.848a156 156 0 0 0-4.241-3.917C100.759 3.829 77.587-4.822 63.673 3.233C50.33 10.957 46.379 33.89 51.995 62.588a171 171 0 0 0 1.892 8.48c-3.28.932-6.445 1.924-9.474 2.98C17.309 83.498 0 98.307 0 113.668c0 15.865 18.582 31.778 46.812 41.427a146 146 0 0 0 6.921 2.165a168 168 0 0 0-2.01 9.138c-5.354 28.2-1.173 50.591 12.134 58.266c13.744 7.926 36.812-.22 59.273-19.855a146 146 0 0 0 5.342-4.923a168 168 0 0 0 6.92 6.314c21.758 18.722 43.246 26.282 56.54 18.586c13.731-7.949 18.194-32.003 12.4-61.268a145 145 0 0 0-1.535-6.842c1.62-.48 3.21-.974 4.76-1.488c29.348-9.723 48.443-25.443 48.443-41.52c0-15.417-17.868-30.326-45.517-39.844m-6.365 70.984q-2.102.694-4.3 1.345c-3.24-10.257-7.612-21.163-12.963-32.432c5.106-11 9.31-21.767 12.459-31.957c2.619.758 5.16 1.557 7.61 2.4c23.69 8.156 38.14 20.213 38.14 29.504c0 9.896-15.606 22.743-40.946 31.14m-10.514 20.834c2.562 12.94 2.927 24.64 1.23 33.787c-1.524 8.219-4.59 13.698-8.382 15.893c-8.067 4.67-25.32-1.4-43.927-17.412a157 157 0 0 1-6.437-5.87c7.214-7.889 14.423-17.06 21.459-27.246c12.376-1.098 24.068-2.894 34.671-5.345q.785 3.162 1.386 6.193M87.276 214.515c-7.882 2.783-14.16 2.863-17.955.675c-8.075-4.657-11.432-22.636-6.853-46.752a157 157 0 0 1 1.869-8.499c10.486 2.32 22.093 3.988 34.498 4.994c7.084 9.967 14.501 19.128 21.976 27.15a135 135 0 0 1-4.877 4.492c-9.933 8.682-19.886 14.842-28.658 17.94M50.35 144.747c-12.483-4.267-22.792-9.812-29.858-15.863c-6.35-5.437-9.555-10.836-9.555-15.216c0-9.322 13.897-21.212 37.076-29.293c2.813-.98 5.757-1.905 8.812-2.773c3.204 10.42 7.406 21.315 12.477 32.332c-5.137 11.18-9.399 22.249-12.634 32.792a135 135 0 0 1-6.318-1.979m12.378-84.26c-4.811-24.587-1.616-43.134 6.425-47.789c8.564-4.958 27.502 2.111 47.463 19.835a144 144 0 0 1 3.841 3.545c-7.438 7.987-14.787 17.08-21.808 26.988c-12.04 1.116-23.565 2.908-34.161 5.309a160 160 0 0 1-1.76-7.887m110.427 27.268a348 348 0 0 0-7.785-12.803c8.168 1.033 15.994 2.404 23.343 4.08c-2.206 7.072-4.956 14.465-8.193 22.045a381 381 0 0 0-7.365-13.322m-45.032-43.861c5.044 5.465 10.096 11.566 15.065 18.186a322 322 0 0 0-30.257-.006c4.974-6.559 10.069-12.652 15.192-18.18M82.802 87.83a323 323 0 0 0-7.227 13.238c-3.184-7.553-5.909-14.98-8.134-22.152c7.304-1.634 15.093-2.97 23.209-3.984a322 322 0 0 0-7.848 12.897m8.081 65.352c-8.385-.936-16.291-2.203-23.593-3.793c2.26-7.3 5.045-14.885 8.298-22.6a321 321 0 0 0 7.257 13.246c2.594 4.48 5.28 8.868 8.038 13.147m37.542 31.03c-5.184-5.592-10.354-11.779-15.403-18.433c4.902.192 9.899.29 14.978.29c5.218 0 10.376-.117 15.453-.343c-4.985 6.774-10.018 12.97-15.028 18.486m52.198-57.817c3.422 7.8 6.306 15.345 8.596 22.52c-7.422 1.694-15.436 3.058-23.88 4.071a382 382 0 0 0 7.859-13.026a347 347 0 0 0 7.425-13.565m-16.898 8.101a359 359 0 0 1-12.281 19.815a329 329 0 0 1-23.444.823c-7.967 0-15.716-.248-23.178-.732a310 310 0 0 1-12.513-19.846h.001a307 307 0 0 1-10.923-20.627a310 310 0 0 1 10.89-20.637l-.001.001a307 307 0 0 1 12.413-19.761c7.613-.576 15.42-.876 23.31-.876H128c7.926 0 15.743.303 23.354.883a329 329 0 0 1 12.335 19.695a359 359 0 0 1 11.036 20.54a330 330 0 0 1-11 20.722m22.56-122.124c8.572 4.944 11.906 24.881 6.52 51.026q-.518 2.504-1.15 5.09c-10.622-2.452-22.155-4.275-34.23-5.408c-7.034-10.017-14.323-19.124-21.64-27.008a161 161 0 0 1 5.888-5.4c18.9-16.447 36.564-22.941 44.612-18.3M128 90.808c12.625 0 22.86 10.235 22.86 22.86s-10.235 22.86-22.86 22.86s-22.86-10.235-22.86-22.86s10.235-22.86 22.86-22.86"/></svg>`;
var tailwind = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><path fill="#38bdf8" d="M64.004 25.602c-17.067 0-27.73 8.53-32 25.597c6.398-8.531 13.867-11.73 22.398-9.597c4.871 1.214 8.352 4.746 12.207 8.66C72.883 56.629 80.145 64 96.004 64c17.066 0 27.73-8.531 32-25.602q-9.6 12.803-22.399 9.602c-4.87-1.215-8.347-4.746-12.207-8.66c-6.27-6.367-13.53-13.738-29.394-13.738M32.004 64c-17.066 0-27.73 8.531-32 25.602Q9.603 76.799 22.402 80c4.871 1.215 8.352 4.746 12.207 8.66c6.274 6.367 13.536 13.738 29.395 13.738c17.066 0 27.73-8.53 32-25.597q-9.6 12.797-22.399 9.597c-4.87-1.214-8.347-4.746-12.207-8.66C55.128 71.371 47.868 64 32.004 64m0 0"/></svg>`;
var vite = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><defs><linearGradient id="SVGN1cfrT9y" x1="6" x2="235" y1="33" y2="344" gradientTransform="translate(0 .937)scale(.3122)" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#41d1ff"/><stop offset="1" stop-color="#bd34fe"/></linearGradient><linearGradient id="SVGk86M3d2e" x1="194.651" x2="236.076" y1="8.818" y2="292.989" gradientTransform="translate(0 .937)scale(.3122)" gradientUnits="userSpaceOnUse"><stop offset="0" stop-color="#ffea83"/><stop offset=".083" stop-color="#ffdd35"/><stop offset="1" stop-color="#ffa800"/></linearGradient></defs><path fill="url(#SVGN1cfrT9y)" d="M124.766 19.52L67.324 122.238c-1.187 2.121-4.234 2.133-5.437.024L3.305 19.532c-1.313-2.302.652-5.087 3.261-4.622L64.07 25.187a3.1 3.1 0 0 0 1.11 0l56.3-10.261c2.598-.473 4.575 2.289 3.286 4.594m0 0"/><path fill="url(#SVGk86M3d2e)" d="M91.46 1.43L48.954 9.758a1.56 1.56 0 0 0-1.258 1.437l-2.617 44.168a1.563 1.563 0 0 0 1.91 1.614l11.836-2.735a1.562 1.562 0 0 1 1.88 1.836l-3.517 17.219a1.562 1.562 0 0 0 1.985 1.805l7.308-2.223c1.133-.344 2.223.652 1.985 1.812l-5.59 27.047c-.348 1.692 1.902 2.614 2.84 1.164l.625-.968l34.64-69.13c.582-1.16-.421-2.48-1.69-2.234l-12.185 2.352a1.558 1.558 0 0 1-1.793-1.965l7.95-27.562A1.56 1.56 0 0 0 91.46 1.43m0 0"/></svg>`;
var reactRouter = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 32 32"><path fill="#f44250" d="M24.4 16a2.78 2.78 0 0 1-2.8 2.8a2.8 2.8 0 0 0-2.8 2.79a2.78 2.78 0 0 1-2.8 2.8a2.8 2.8 0 1 1 0-5.6a2.8 2.8 0 1 0 0-5.58a2.8 2.8 0 1 1 2.8-2.8a2.78 2.78 0 0 0 2.8 2.8A2.8 2.8 0 0 1 24.4 16"/><path fill="#d2d2d2" d="M13.2 16a2.8 2.8 0 1 0-5.6 0a2.8 2.8 0 0 0 5.6 0m-5.6 5.59a2.8 2.8 0 1 0-5.6 0a2.8 2.8 0 0 0 5.6 0m22.4 0a2.8 2.8 0 1 0-5.6 0a2.8 2.8 0 0 0 5.6 0"/></svg>`;
var axios = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><path fill="#fff" d="m34 43.978l27.38-22.913l.038 91.495l-9.32 7.74l-.153-76.091zm62.962 38.345l-27.38 22.912l-.038-91.495L78.863 6l.154 76.091z"/></svg>`;
var socket = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 256"><path fill="#fff" d="M96.447 7.382c32.267-8.275 67.929-3.453 96.386 14.11c35.84 21.433 59.238 61.976 59.833 103.71c1.31 42.15-20.659 83.944-55.963 106.865c-39.293 26.433-93.648 27.446-133.775 2.322c-40.9-24.41-64.774-73.645-58.641-120.916c4.94-49.95 43.52-94.005 92.16-106.09"/><path fill="#000" d="M91.505 27.803c60.964-24.41 135.74 20.658 142.05 86.028c9.824 58.82-38.995 118.593-98.59 120.32c-56.677 5.656-111.449-42.39-113.056-99.304c-4.227-46.08 26.136-91.803 69.596-107.044"/><path fill="#fff" d="M97.637 121.69c27.327-22.326 54.058-45.426 81.98-67.097c-14.646 22.505-29.708 44.711-44.354 67.215c-12.562.06-25.123.06-37.626-.119m23.1 12.443c12.621 0 25.183 0 37.745.179c-27.505 22.206-54.117 45.484-82.099 67.096c14.646-22.505 29.708-44.77 44.354-67.275"/></svg>`;
var motion = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><path fill="#FFF42B" d="M48.379 39.997L23.063 88.003H0L19.77 50.52c3.064-5.814 10.708-10.523 17.078-10.523ZM104.937 52c0-6.631 5.162-12.002 11.531-12.002S128 45.368 128 52c0 6.629-5.162 12-11.532 12c-6.369 0-11.531-5.37-11.531-12.001M52.703 39.997h23.063L50.45 88.003H27.387Zm27.238 0h23.063L83.241 77.48c-3.065 5.814-10.715 10.523-17.084 10.523H54.625Z"/></svg>`;
var npm = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><path fill="#cb3837" d="M0 7.062C0 3.225 3.225 0 7.062 0h113.88c3.838 0 7.063 3.225 7.063 7.062v113.88c0 3.838-3.225 7.063-7.063 7.063H7.062c-3.837 0-7.062-3.225-7.062-7.063zm23.69 97.518h40.395l.05-58.532h19.494l-.05 58.581h19.543l.05-78.075l-78.075-.1l-.1 78.126z"/><path fill="#fff" d="M25.105 65.52V26.512H40.96c8.72 0 26.274.034 39.008.075l23.153.075v77.866H83.645v-58.54H64.057v58.54H25.105z"/></svg>`;

var nodeJS = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 32 32"><path fill="#83cd29" d="M16 30a2.15 2.15 0 0 1-1.076-.288L11.5 27.685c-.511-.286-.262-.387-.093-.446a6.8 6.8 0 0 0 1.549-.7a.26.26 0 0 1 .255.019l2.631 1.563a.34.34 0 0 0 .318 0l10.26-5.922a.32.32 0 0 0 .157-.278V10.075a.33.33 0 0 0-.159-.283l-10.26-5.917a.32.32 0 0 0-.317 0L5.587 9.794a.33.33 0 0 0-.162.281v11.841a.32.32 0 0 0 .161.274L8.4 23.814c1.525.762 2.459-.136 2.459-1.038V11.085a.3.3 0 0 1 .3-.3h1.3a.3.3 0 0 1 .3.3v11.692c0 2.035-1.108 3.2-3.038 3.2a4.4 4.4 0 0 1-2.363-.642l-2.697-1.547a2.17 2.17 0 0 1-1.076-1.872V10.075A2.16 2.16 0 0 1 4.661 8.2l10.261-5.924a2.25 2.25 0 0 1 2.156 0L27.338 8.2a2.17 2.17 0 0 1 1.077 1.87v11.846a2.17 2.17 0 0 1-1.077 1.872l-10.26 5.924A2.15 2.15 0 0 1 16 30"/><path fill="#83cd29" d="M14.054 17.953a.3.3 0 0 1 .3-.3h1.327a.3.3 0 0 1 .295.251c.2 1.351.8 2.032 3.513 2.032c2.161 0 3.082-.489 3.082-1.636c0-.661-.261-1.152-3.62-1.481c-2.808-.278-4.544-.9-4.544-3.144c0-2.07 1.745-3.305 4.67-3.305c3.287 0 4.914 1.141 5.12 3.589a.3.3 0 0 1-.295.323h-1.336a.3.3 0 0 1-.288-.232c-.319-1.421-1.1-1.875-3.2-1.875c-2.36 0-2.634.822-2.634 1.438c0 .746.324.964 3.51 1.385c3.153.417 4.651 1.007 4.651 3.223c0 2.236-1.864 3.516-5.115 3.516c-4.495.006-5.436-2.055-5.436-3.784"/></svg>`;
var mongoDB = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 549"><path fill="#01ec64" d="M175.622 61.108C152.612 33.807 132.797 6.078 128.749.32a1.03 1.03 0 0 0-1.492 0c-4.048 5.759-23.863 33.487-46.874 60.788c-197.507 251.896 31.108 421.89 31.108 421.89l1.917 1.28c1.704 26.234 5.966 63.988 5.966 63.988h17.045s4.26-37.54 5.965-63.987l1.918-1.494c.213.214 228.828-169.78 31.32-421.677m-47.726 418.05s-10.227-8.744-12.997-13.222v-.428l12.358-274.292c0-.853 1.279-.853 1.279 0l12.357 274.292v.428c-2.77 4.478-12.997 13.223-12.997 13.223"/></svg>`;
var expressJS = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 24 24"><path fill="#fff" d="M24 18.588a1.53 1.53 0 0 1-1.895-.72l-3.45-4.771l-.5-.667l-4.003 5.444a1.466 1.466 0 0 1-1.802.708l5.158-6.92l-4.798-6.251a1.595 1.595 0 0 1 1.9.666l3.576 4.83l3.596-4.81a1.435 1.435 0 0 1 1.788-.668L21.708 7.9l-2.522 3.283a.666.666 0 0 0 0 .994l4.804 6.412zM.002 11.576l.42-2.075c1.154-4.103 5.858-5.81 9.094-3.27c1.895 1.489 2.368 3.597 2.275 5.973H1.116C.943 16.447 4.005 19.009 7.92 17.7a4.08 4.08 0 0 0 2.582-2.876c.207-.666.548-.78 1.174-.588a5.42 5.42 0 0 1-2.589 3.957a6.27 6.27 0 0 1-7.306-.933a6.58 6.58 0 0 1-1.64-3.858c0-.235-.08-.455-.134-.666A88 88 0 0 1 0 11.577zm1.127-.286h9.654c-.06-3.076-2.001-5.258-4.59-5.278c-2.882-.04-4.944 2.094-5.071 5.264z"/></svg>`;
var cloudinary = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 168"><path fill="#3448c5" d="M75.06 75.202a.7.7 0 0 1 .498.208l23.56 23.581a.7.7 0 0 1-.488 1.188h-6.022a.72.72 0 0 0-.721.7v53.015a12.72 12.72 0 0 0 3.71 8.949l3.52 3.52a.7.7 0 0 1-.487 1.187H70.85c-7.027 0-12.723-5.696-12.723-12.723v-53.948a.7.7 0 0 0-.7-.7h-5.938a.7.7 0 0 1-.509-1.188l23.581-23.58a.7.7 0 0 1 .499-.21m52.103 13.656a.7.7 0 0 1 .498.209l23.581 23.496a.7.7 0 0 1-.509 1.188h-6.022a.72.72 0 0 0-.7.72v39.423a12.72 12.72 0 0 0 3.69 8.949l3.541 3.52a.7.7 0 0 1-.509 1.187h-27.716c-7.027 0-12.724-5.696-12.724-12.723v-40.313a.72.72 0 0 0-.7-.721h-6a.7.7 0 0 1-.488-1.188l23.56-23.538a.7.7 0 0 1 .498-.209m52.114 13.51c.183 0 .36.075.487.207l23.581 23.56a.7.7 0 0 1-.487 1.209h-6.044a.7.7 0 0 0-.7.7v25.85a12.72 12.72 0 0 0 3.711 8.949l3.52 3.52a.7.7 0 0 1-.487 1.187h-27.801c-7.027 0-12.724-5.696-12.724-12.723v-26.784a.7.7 0 0 0-.7-.7h-5.937a.7.7 0 0 1-.488-1.208l23.58-23.56a.68.68 0 0 1 .489-.207M126.686-.002c37.04.27 69.71 24.323 80.964 59.614c27.51 3.59 48.15 26.928 48.35 54.668c0 22.895-14.319 41.921-37.438 49.842l-.86.289l-1.06.339v-17.092c14.695-6.192 23.326-18.428 23.326-33.378c-.075-21.097-16.782-38.323-37.78-39.126l-.709-.02h-6.361l-1.527-6.066c-7.494-30.93-35.08-52.79-66.905-53.015a68.18 68.18 0 0 0-61.576 38.23l-2.36 4.861l-4.454.467c-20.112 2.151-36.627 16.862-41.08 36.593c-4.39 19.449 3.898 39.527 20.646 50.231l.734.46v18.025h-.106l-1.59-.721C11.744 152.636-2.99 126.08.51 98.616c3.502-27.463 24.428-49.474 51.68-54.358C66.912 16.851 95.575-.177 126.686-.002"/></svg>`;

var vsCode = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><mask id="SVGescYAbDI" width="128" height="128" x="0" y="0" maskUnits="userSpaceOnUse" style="mask-type:alpha"><path fill="#fff" fill-rule="evenodd" d="M90.767 127.126a7.97 7.97 0 0 0 6.35-.244l26.353-12.681a8 8 0 0 0 4.53-7.209V21.009a8 8 0 0 0-4.53-7.21L97.117 1.12a7.97 7.97 0 0 0-9.093 1.548l-50.45 46.026L15.6 32.013a5.33 5.33 0 0 0-6.807.302l-7.048 6.411a5.335 5.335 0 0 0-.006 7.888L20.796 64L1.74 81.387a5.336 5.336 0 0 0 .006 7.887l7.048 6.411a5.33 5.33 0 0 0 6.807.303l21.974-16.68l50.45 46.025a8 8 0 0 0 2.743 1.793Zm5.252-92.183L57.74 64l38.28 29.058V34.943Z" clip-rule="evenodd"/></mask><g mask="url(#SVGescYAbDI)"><path fill="#0065a9" d="M123.471 13.82L97.097 1.12A7.97 7.97 0 0 0 88 2.668L1.662 81.387a5.333 5.333 0 0 0 .006 7.887l7.052 6.411a5.33 5.33 0 0 0 6.811.303l103.971-78.875c3.488-2.646 8.498-.158 8.498 4.22v-.306a8 8 0 0 0-4.529-7.208Z"/><g filter="url(#SVGUBw6ic8w)"><path fill="#007acc" d="m123.471 114.181l-26.374 12.698A7.97 7.97 0 0 1 88 125.333L1.662 46.613a5.333 5.333 0 0 1 .006-7.887l7.052-6.411a5.33 5.33 0 0 1 6.811-.303l103.971 78.874c3.488 2.647 8.498.159 8.498-4.219v.306a8 8 0 0 1-4.529 7.208"/></g><g filter="url(#SVGg9RgH3Uo)"><path fill="#1f9cf0" d="M97.098 126.882A7.98 7.98 0 0 1 88 125.333c2.952 2.952 8 .861 8-3.314V5.98c0-4.175-5.048-6.266-8-3.313a7.98 7.98 0 0 1 9.098-1.549L123.467 13.8A8 8 0 0 1 128 21.01v85.982a8 8 0 0 1-4.533 7.21z"/></g><path fill="url(#SVGpqCa3cMW)" fill-rule="evenodd" d="M90.69 127.126a7.97 7.97 0 0 0 6.349-.244l26.353-12.681a8 8 0 0 0 4.53-7.21V21.009a8 8 0 0 0-4.53-7.21L97.039 1.12a7.97 7.97 0 0 0-9.093 1.548l-50.45 46.026l-21.974-16.68a5.33 5.33 0 0 0-6.807.302l-7.048 6.411a5.336 5.336 0 0 0-.006 7.888L20.718 64L1.662 81.386a5.335 5.335 0 0 0 .006 7.888l7.048 6.411a5.33 5.33 0 0 0 6.807.303l21.975-16.681l50.45 46.026a8 8 0 0 0 2.742 1.793m5.252-92.184L57.662 64l38.28 29.057z" clip-rule="evenodd" opacity="0.25"/></g><defs><filter id="SVGUBw6ic8w" width="144.744" height="113.408" x="-8.411" y="22.594" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feFlood flood-opacity="0" result="BackgroundImageFix"/><feColorMatrix in="SourceAlpha" result="hardAlpha" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"/><feOffset/><feGaussianBlur stdDeviation="4.167"/><feColorMatrix values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/><feBlend in2="BackgroundImageFix" mode="overlay" result="effect1_dropShadow_1_36"/><feBlend in="SourceGraphic" in2="effect1_dropShadow_1_36" result="shape"/></filter><filter id="SVGg9RgH3Uo" width="56.667" height="144.007" x="79.667" y="-8.004" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feFlood flood-opacity="0" result="BackgroundImageFix"/><feColorMatrix in="SourceAlpha" result="hardAlpha" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"/><feOffset/><feGaussianBlur stdDeviation="4.167"/><feColorMatrix values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/><feBlend in2="BackgroundImageFix" mode="overlay" result="effect1_dropShadow_1_36"/><feBlend in="SourceGraphic" in2="effect1_dropShadow_1_36" result="shape"/></filter><linearGradient id="SVGpqCa3cMW" x1="63.922" x2="63.922" y1=".33" y2="127.67" gradientUnits="userSpaceOnUse"><stop stop-color="#fff"/><stop offset="1" stop-color="#fff" stop-opacity="0"/></linearGradient></defs></svg>`;
var chatGPT = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 48 48"><path fill="none" stroke="#fff" stroke-linejoin="round" d="M18.38 27.94v-14.4l11.19-6.46c6.2-3.58 17.3 5.25 12.64 13.33" stroke-width="2"/><path fill="none" stroke="#fff" stroke-linejoin="round" d="m18.38 20.94l12.47-7.2l11.19 6.46c6.2 3.58 4.1 17.61-5.23 17.61" stroke-width="2"/><path fill="none" stroke="#fff" stroke-linejoin="round" d="m24.44 17.44l12.47 7.2v12.93c0 7.16-13.2 12.36-17.86 4.28" stroke-width="2"/><path fill="none" stroke="#fff" stroke-linejoin="round" d="M30.5 21.2v14.14L19.31 41.8c-6.2 3.58-17.3-5.25-12.64-13.33" stroke-width="2"/><path fill="none" stroke="#fff" stroke-linejoin="round" d="m30.5 27.94l-12.47 7.2l-11.19-6.46c-6.21-3.59-4.11-17.61 5.22-17.61" stroke-width="2"/><path fill="none" stroke="#fff" stroke-linejoin="round" d="m24.44 31.44l-12.47-7.2V11.31c0-7.16 13.2-12.36 17.86-4.28" stroke-width="2"/></svg>`;
var youtube = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 180"><path fill="#f00" d="M250.346 28.075A32.18 32.18 0 0 0 227.69 5.418C207.824 0 127.87 0 127.87 0S47.912.164 28.046 5.582A32.18 32.18 0 0 0 5.39 28.24c-6.009 35.298-8.34 89.084.165 122.97a32.18 32.18 0 0 0 22.656 22.657c19.866 5.418 99.822 5.418 99.822 5.418s79.955 0 99.82-5.418a32.18 32.18 0 0 0 22.657-22.657c6.338-35.348 8.291-89.1-.164-123.134"/><path fill="#fff" d="m102.421 128.06l66.328-38.418l-66.328-38.418z"/></svg>`;
var figma = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 256 384"><path fill="#0acf83" d="M64 384c35.328 0 64-28.672 64-64v-64H64c-35.328 0-64 28.672-64 64s28.672 64 64 64"/><path fill="#a259ff" d="M0 192c0-35.328 28.672-64 64-64h64v128H64c-35.328 0-64-28.672-64-64"/><path fill="#f24e1e" d="M0 64C0 28.672 28.672 0 64 0h64v128H64C28.672 128 0 99.328 0 64"/><path fill="#ff7262" d="M128 0h64c35.328 0 64 28.672 64 64s-28.672 64-64 64h-64z"/><path fill="#1abcfe" d="M256 192c0 35.328-28.672 64-64 64s-64-28.672-64-64s28.672-64 64-64s64 28.672 64 64"/></svg>`;
var canva = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 128 128"><g fill="#00c4cc"><path d="M59.39.152c-.484.051-1.995.23-3.328.387c-5.374.613-11.468 2.227-16.816 4.48C19.891 13.106 5.324 30.849 1.305 51.2C.359 56.04.129 58.418.129 64c0 7.195.715 12.16 2.61 18.434c6.195 20.53 22.323 36.632 42.906 42.851c6.195 1.871 11.187 2.586 18.355 2.586c7.195 0 12.16-.715 18.434-2.61c20.53-6.195 36.632-22.323 42.851-42.906c1.871-6.195 2.586-11.187 2.586-18.355c0-3.047-.152-6.527-.332-7.809c-2.074-14.796-8.168-27.238-18.328-37.402C99.07 8.703 86.68 2.586 72.19.512c-1.996-.282-11.238-.54-12.8-.36m-20.863 40.32c1.36.41 1.996.794 2.918 1.715c1.793 1.82 2.203 2.817 2.203 5.555c0 2.051-.078 2.434-.691 3.508c-1.18 1.996-3.918 3.84-5.812 3.89c-1.333.028-1.278-.562.18-2.097c1.945-2.023 2.226-2.79 2.226-5.813c-.024-2.917-.383-3.914-1.739-4.734c-1.128-.691-2.355-.64-4.148.203c-4.66 2.23-9.703 9.653-11.672 17.258c-2.613 10.137 2.02 18.25 9.649 16.867c2.226-.41 6.425-2.558 8.246-4.25c1.508-1.379 1.508-1.406 1.66-3.12c.336-3.587 2.867-7.169 6.25-8.833c1.558-.77 1.945-.844 4.043-.844c1.996 0 2.457.102 3.43.637c3.097 1.77 2.457 5.89-.895 5.89c-1.945 0-2.945-1-1.535-1.534c1.383-.512.867-2.434-.742-2.868c-1.895-.488-4.047.793-5.403 3.25c-1.64 2.97-1.715 6.504-.156 8.114c1.512 1.613 3.406.336 4.867-3.329c.766-1.867 1.867-2.867 3.149-2.867c1.125 0 1.332.692.843 2.793c-.718 3.25-.23 4.094 1.793 3.098c.664-.309 1.766-1.023 2.43-1.535l1.254-1l.848-4.43c.922-4.965 1.277-5.633 3.172-5.988c1.82-.336 2.23.562 1.562 3.402l-.36 1.59l1.333-1.36c3.148-3.226 7.015-4.812 8.347-3.48c.715.715.637 1.613-.386 4.785c-.485 1.512-1.153 3.895-1.457 5.25c-.461 2.047-.489 2.535-.23 2.868c.82.972 3.327-.028 5.554-2.204l1.305-1.277l.156-2.844c.152-3.277.457-4.453 1.328-5.504c.82-.972 2.305-1.687 3.098-1.484c.793.207.793.973.078 3.227c-1 3.097-.895 10.238.129 10.238c.41 0 2.507-2.2 3.84-4.043l.996-1.36l-.793-.816c-1.383-1.46-1.715-2.406-1.715-4.789c0-1.738.129-2.379.562-3.227c.719-1.328 1.844-2.3 3.176-2.687c1.406-.434 3.148.281 3.863 1.562c.719 1.305.54 4.223-.383 6.223l-.664 1.457h.895c1.23 0 1.715-.305 3.918-2.379c1.152-1.101 2.484-2.05 3.48-2.511c3.918-1.84 8.528-.895 9.293 1.921c.64 2.254-.765 3.84-3.226 3.66c-1.766-.128-2.098-.59-1.074-1.456c1.843-1.54 0-3.508-2.637-2.793c-1.434.386-3.047 1.996-3.89 3.867c-1.692 3.738-.794 8.14 1.636 8.14c.973 0 2.691-1.921 3.355-3.789c.793-2.152 2.457-3.507 3.711-3.02c.692.255.743.946.309 3.122c-.488 2.383-.563 4.61-.18 5.633c.153.382.614 1.101 1.051 1.586c.816.921.844 1.254.152 1.691c-.332.23-.77.129-1.843-.46c-1.485-.77-2.766-2.153-3.227-3.458l-.281-.766l-1.024.766c-.59.41-1.511.871-2.047 1.023c-2.125.563-4.738-.894-5.964-3.351c-.489-.95-.641-3.738-.282-4.813c.204-.59.204-.59-.617-.18c-.433.231-1.355.485-2.07.563c-1.18.13-1.36.258-2.535 1.742c-1.664 2.07-4.61 4.864-5.813 5.454c-2.558 1.277-3.402.918-4.07-1.72l-.461-1.765l-1.102.973c-1.406 1.23-4.222 2.715-5.836 3.074c-1.535.332-3.175-.156-3.84-1.18c-.995-1.535-.663-4.785.922-9.164c1.176-3.25.333-3.3-2.636-.203c-2.203 2.328-3.149 3.992-3.762 6.578c-.64 2.688-1.41 3.66-3.148 4.07c-1.051.231-1.54-.41-1.332-1.816l.152-1.129l-.973.668c-1.383.946-3.125 1.817-4.328 2.149s-2.789-.024-3.172-.692c-.691-1.175-.691-1.175-1.765-.332c-2.332 1.895-5.66 1.356-7.348-1.152l-.54-.793l-1.687 1.562c-4.867 4.454-10.957 6.45-15.464 5.067c-5.735-1.738-8.907-6.656-8.856-13.746c.024-7.117 3.172-14.617 8.473-20.172c2.996-3.125 5.812-4.969 8.68-5.66c2.07-.512 3.328-.485 5.296.129zm0 0"/><path d="M90.418 58.676c-.563.562-.356 2.816.36 4.25c.359.742.742 1.332.87 1.332c.102 0 .332-.59.512-1.309c.64-2.66-.512-5.504-1.742-4.273m0 0"/></g></svg>`;
var gemini = `<svg xmlns="http://www.w3.org/2000/svg" width="100%" height="100%" viewBox="0 0 32 32"><defs><path id="SVG8iAahc8M" fill="#fff" d="M57.067 28.61q-7.396-3.184-12.945-8.732q-5.547-5.546-8.732-12.944a38.4 38.4 0 0 1-1.97-5.824A1.464 1.464 0 0 0 32 .001c-.671 0-1.255.458-1.419 1.11a38.4 38.4 0 0 1-1.971 5.823q-3.186 7.397-8.732 12.944q-5.548 5.548-12.945 8.732a38.4 38.4 0 0 1-5.824 1.972A1.464 1.464 0 0 0 0 32c0 .67.458 1.255 1.11 1.418a38.4 38.4 0 0 1 5.823 1.972q7.396 3.184 12.945 8.732q5.55 5.546 8.732 12.944a38.4 38.4 0 0 1 1.971 5.824c.164.65.749 1.11 1.419 1.11s1.255-.458 1.419-1.11a38.4 38.4 0 0 1 1.971-5.823q3.185-7.395 8.732-12.944q5.548-5.548 12.945-8.732a38.4 38.4 0 0 1 5.824-1.972A1.464 1.464 0 0 0 64 32.001c0-.672-.458-1.255-1.11-1.42a38.4 38.4 0 0 1-5.823-1.97"/></defs><g fill="none"><g mask="url(#SVGrwDDMAfw)" transform="translate(2 2)scale(.4375)"><use href="#SVG8iAahc8M"/><g filter="url(#SVG4022te6D)"><ellipse cx="14.208" cy="16.716" fill="#ffe432" rx="14.208" ry="16.716" transform="rotate(19.552 -43.96 -16.268)"/></g><g filter="url(#SVGfWehPcwe)"><ellipse cx="27.054" cy="2.551" fill="#fc413d" rx="18.394" ry="18.799"/></g><g filter="url(#SVGOVrG7dor)"><ellipse cx="19.224" cy="24.904" fill="#00b95c" rx="19.224" ry="24.904" transform="rotate(-2.799 667.58 51.694)"/></g><g filter="url(#SVGOVrG7dor)"><ellipse cx="18.843" cy="20.744" fill="#00b95c" rx="18.843" ry="20.744" transform="rotate(-31.317 81.174 36.482)"/></g><g filter="url(#SVGZfuD4bKL)"><ellipse cx="66.462" cy="24.977" fill="#3186ff" rx="18.093" ry="17.423"/></g><g filter="url(#SVGZWZ8re1E)"><ellipse cx="20.929" cy="22.075" fill="#fbbc04" rx="20.929" ry="22.075" transform="rotate(37.251 9.618 -7.898)"/></g><g filter="url(#SVG5frwbcHz)"><ellipse cx="24.131" cy="22.292" fill="#3186ff" rx="24.131" ry="22.292" transform="rotate(34.51 19.317 63.957)"/></g><g filter="url(#SVGQLeO6cNv)"><path fill="#749bff" d="M54.226-2.304c2.794 3.799-.797 11.184-8.02 16.497c-7.222 5.312-15.342 6.539-18.136 2.74S28.866 5.75 36.09.436c7.223-5.312 15.343-6.539 18.136-2.74"/></g><g filter="url(#SVG0Tg9pchZ)"><ellipse cx="27.585" cy="17.148" fill="#fc413d" rx="27.585" ry="17.148" transform="rotate(-42.847 5.973 20.37)"/></g><g filter="url(#SVG2faIRbvE)"><ellipse cx="14.782" cy="8.596" fill="#ffee48" rx="14.782" ry="8.596" transform="rotate(35.592 -44.338 25.191)"/></g></g><defs><filter id="SVG4022te6D" width="38.868" height="42.756" x="-19.618" y="12.903" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="2.46"/></filter><filter id="SVGfWehPcwe" width="84.353" height="85.162" x="-15.122" y="-40.03" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="11.891"/></filter><filter id="SVGOVrG7dor" width="78.916" height="90.22" x="-20.768" y="11.483" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="10.109"/></filter><filter id="SVGZfuD4bKL" width="74.611" height="73.27" x="29.156" y="-11.658" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="9.606"/></filter><filter id="SVGZWZ8re1E" width="77.538" height="78.151" x="-38.291" y="-16.269" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="8.706"/></filter><filter id="SVG5frwbcHz" width="78.218" height="76.898" x="7.78" y="-6.098" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="7.775"/></filter><filter id="SVGQLeO6cNv" width="55.879" height="51.479" x="13.208" y="-18.425" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="6.957"/></filter><filter id="SVG0Tg9pchZ" width="70.203" height="68.674" x="-15.474" y="-31.027" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="5.876"/></filter><filter id="SVG2faIRbvE" width="55.137" height="51.261" x="-14.173" y="20.474" color-interpolation-filters="sRGB" filterUnits="userSpaceOnUse"><feGaussianBlur stdDeviation="7.273"/></filter><mask id="SVGrwDDMAfw" width="64" height="64" x="0" y="0" maskUnits="userSpaceOnUse"><use href="#SVG8iAahc8M"/></mask></defs></g></svg>`;

export const assets = {
  facebook_logo,
  github_logo,
  link_logo,
  link_arrow_logo,
  prototype
}

export const skills = [
  {
    category: 'Frontend',
    tool: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": vite,
        "name": "Vite"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": socket,
        "name": "Socket.IO"
      },
      {
        "icon": motion,
        "name": "Motion"
      },
      {
        "icon": npm,
        "name": "NPM"
      },
    ]
  },
  {
    category: 'Backend',
    tool: [
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
      {
        "icon": cloudinary,
        "name": "Cloudinary"
      },
      {
        "icon": socket,
        "name": "Socket.IO"
      },
    ]
  },
  {
    category: 'Tools',
    tool: [
      {
        "icon": vsCode,
        "name": "Visual Studio Code"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB Compass"
      },
      {
        "icon": chatGPT,
        "name": "ChatGPT"
      },
      {
        "icon": youtube,
        "name": "Youtube"
      },
      {
        "icon": figma,
        "name": "Figma"
      },
    ]
  },
  {
    category: 'Other Skills',
    tool: [
      {
        "icon": canva,
        "name": "Canva"
      }
    ]
  }
]

export const buttons = [
  {
    icon: link_logo,
    text: "Live Demo"
  },
  {
    icon: link_arrow_logo,
    text: "Project"
  },
  {
    icon: figma,
    text: "Figma"
  },
]

export const paragraphs = [
  'ผมชื่อ ต่อวัย พิมพบุตร ชื่อเล่น แชมป์ อายุ 18 ปี มึความสนใจเกี่ยวกับคอมพิวเตอร์ตั้งแต่ยังเด็ก เนื่องจากมีโอกาสได้ไปเล่นเกมที่ร้านเกมกับพี่ชาย จึงทำมีความชอบในการเล่นเกมเช่นกัน — ผมได้โน๊ตบุ๊คเครื่องแรกตอน ม.3 หลังจากได้โน๊ตบุ๊คมา ผมก็ได้เล่นเกม PC แบบสมใจอยาก — ในไม่นานผมก็ได้เริ่มใช้โน๊ตบุ๊คทำสไลด์นำเสอนงาน ทำรายงาน และใช้เขียนโค้ด แต่การเขียนโค้ดก็ยังออกมาไม่ดีมาก ผมจึงได้ไปศึกษาเพิ่มเติม นั้นทำให้รู้ว่าผมอยากจะเขียนโค้ดและชอบที่จะได้เรียนรู้สิ่งใหม่ๆ',
  'ผมเริ่มศึกษาและฝึกเขียนโค้ดอย่างจริงจังตั้งแต่ ม.4 ( 2567 ) โดยได้ตั้งเป้าหมายไว้ว่าภายใน พ.ศ.2567 - 2570 จะต้องมีทักษะในการพัฒนาเว็บไซต์ทั้ง Frontend  Backend และสามารถใช้เครื่องมือได้อย่างชำนาญ ผมเริ่มต้นจากการศึกษาที่ฝั่ง Frontend เพื่อทำเกี่ยวกับหน้าเว็บ แล้วไปศึกษาต่อที่ฝั่ง Backend เพื่อให้เว็บไซต์สามารถทำงานร่วมกับฐานข้อมูลได้ หลังนั้นจึงเริ่มใช้ Figma เพื่อออกแบบโครงสร้างเว็บไซต์และใช้ GitHub เพื่อให้สามารถอัปเดตหรือแก้ไข Project ได้โดยที่ไม่กระทบกับ Main Project',
  'หลังจากที่มีพื้นฐาน ผมก็เริ่มฝึกสร้างเว็บไซต์แบบ Full Stack โดยใช้ MongoDB Express.js React Node.js ( MERN ) ในการเขียนโค้ดเป็นหลัก โดยส่วนใหญ่ก็เพื่อฝึกทักษะในการแก้ไขปัญหาอยางเป็นระบบ หลังจากที่สร้างเว็บไซต์เสร็จก็จะมาทบโค้ดที่ได้เขียนลงไปอีกที แล้วส่งโค้ดให้ AI ตรวจสอบและให้แนะนำจุดที่ควรแก้เพื่อให้โค้ดทำงานได้อย่างมีประสิทธิภาพ',
  'เวลาที่ทำงานผมมักจะฟังเพลง เพราะทำให้รู้สึกทำงานได้ดีและมีสมาธิมากขึ้น — เมื่อไม่ได้ทำงานจะพักผ่อนด้วยการเปิด Podcast ฟังพร้อมไปกับการเล่นเกม หรือดูอนิเมะและภาพยนต์'
]

export const projectCard = [
  {
    name: 'Portfolio',
    description: 'เว็บไซต์ Portfolio ส่วนตัวที่สร้างขึ้นเพื่อแสดงทักษะ ผลงาน และวิธีการคิด โดยใช้ Figma ในการออกแบบ และใช้ React ในการสร้าง',
    tool: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": motion,
        "name": "Motion"
      },
    ],
    video: portfolio,
    link: 'https://www.figma.com/design/ssKHDghC8rimcZPJsYX0By/Portfolio?node-id=0-1&p=f&t=Nk4GkhFtciEyoige-0',
  },
  {
    name: 'ChatApp',
    description: 'Chat App สามารถสนทนา ส่งข้อความและรูปภาพได้แบบเรียลไทม์ ใช้ React และ Tailwind ในการสร้างแอป และใช้ Socket.IO ในการทำระบบรับส่งข้อความแบบเรียลไทม์',
    tool: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": socket,
        "name": "Socket.IO"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
      {
        "icon": cloudinary,
        "name": "Cloudinary"
      },
    ],
    video: chatApp,
    link: '/',
  },
  {
    name: 'QuickBlog',
    description: 'Web Blog ที่ใช้ AI เข้ามาช่วยในการสร้าง blog โดยใช้ Gemini API มาช่วยในการคิด description ใช้ React และ Node.js ในการพัฒนา',
    tool: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": socket,
        "name": "Socket.IO"
      },
      {
        "icon": motion,
        "name": "Motion"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
      {
        "icon": gemini,
        "name": "Gemini"
      },
    ],
    video: quickblog,
    link: '/',
  },
  {
    name: 'Auth',
    description: 'Auth App ทำขึ้นเพื่อแสดงทักษะในการทำระบบ login หรือ sign up การจัดการกับข้อมูลหลังยืนยันตัวตน และมี่การส่ง OTP เพื่อยืนยันและรีเซ็ตรหัส ใช้ React และ Node.js ในการพัฒนา',
    tool: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
    ],
    video: auth,
    link: '/',
  },
]

export const projectInfo = [
  {
    logo: quickchat_logo,
    name: 'QuickChat',
    description: 'Chat App สามารถสนทนา ส่งข้อความและรูปภาพได้แบบเรียลไทม์ ใช้ React และ Tailwind ในการสร้างแอป และใช้ Socket.IO ในการทำระบบรับส่งข้อความแบบเรียลไทม์',
    video: chatApp,
    feature: [
      {
        title: 'Sign Up & Login',
        detail: 'ระบบสำหรับสร้างบัญชีหรือใส่ข้อมูลเพื่อเข้าสู่บัญชี',
      },
      {
        title: 'Notificaction',
        detail: 'การแจ้งเตือนเมื่อเข้าสู่บัญชี ออกจากบัญชีหรือทำการแก้ไขข้อมูลบัญชี',
      },
      {
        title: 'User Search',
        detail: 'ระบบค้นหาผู้ใช้งานโดยใช้ชื่อ',
      },
      {
        title: 'Edit Profile',
        detail: 'ระบบแก้ข้อมูลบัญชีผู้ใช้งาน',
      },
      {
        title: 'Real-Time Chat',
        detail: 'การสนทนาระหว่างผู้ใช้แบบเรียลไทม์ โดยใช้ Socket.IO เพื่อให้สามารถสนทนาได้อย่างราบรื่น',
      },
      {
        title: 'Responsive Design',
        detail: 'ใช้งานเว็บไซต์ได้อย่างราบรื่นกับทุกอุปกรณ์ ดีไซต์ที่ออกแบบมาเพื่อตอบสนองต่อขนาดหน้าจอต่างๆ',
      },
    ],
    tech: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": socket,
        "name": "Socket.IO"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
      {
        "icon": cloudinary,
        "name": "Cloudinary"
      },
    ],
  },
  {
    logo: quickblog_logo,
    name: 'QuickBlog',
    description: 'Web Blog ที่ใช้ AI เข้ามาช่วยในการสร้าง blog โดยใช้ Gemini API มาช่วยในการคิด description ใช้ React และ Node.js ในการพัฒนา',
    video: quickblog,
    feature: [
      {
        title: 'Responsive Design',
        detail: 'ใช้งานเว็บไซต์ได้อย่างราบรื่นกับทุกอุปกรณ์ ดีไซต์ที่ออกแบบมาเพื่อตอบสนองต่อขนาดหน้าจอต่างๆ',
      },
      {
        title: 'Blog title and category search',
        detail: 'ค้นหาบล็อกที่ต้องการได้อย่างง่าย โดยใช้เพียงแค่หมวดหมู่หรือชื่อบล็อก',
      },
      {
        title: 'login',
        detail: 'ระบบยืนยันตัวตนเพื่อเข้าไปจัดเกี่ยวกับบล็อกและความคิดเห็นต่างๆ',
      },
      {
        title: 'Dashboard',
        detail: 'แสดงข้อมูลจำนวนบล็อก ความคิดเห็น และบล็อกที่ยังไม่ได้เผยแพร่',
      },
      {
        title: 'Blogs list',
        detail: 'จัดการกับรายการบล็อกทั้งหมด สามารถเผยแพร่ ไม่เผยแพร่ หรือลบบล็อกที่สร้างขึ้นได้',
      },
      {
        title: 'Comments list',
        detail: 'จัดการกับความคิดเห็นที่ส่งเข้า โดยให้เผยแพร่หรือลบความคิดเห็น',
      },
      {
        title: 'Add Blog ',
        detail: 'สามารถเพิ่มบล็อกและจัดการข้อมูลต่างๆ ก่อนเพิ่มเข้าไปในเว็บบล็อก',
      },
      {
        title: 'Add Comment',
        detail: 'สามารถแสดงความคิดเห็นในแต่ละบล็อกที่เข้าไปดูได้',
      },
      {
        title: 'Generate Description',
        detail: 'ใช้ Gemini API ในการสร้างเนื้อหาภายในบล็อก โดยใช้ชื่อบล็อก',
      },
    ],
    tech: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": motion,
        "name": "Motion"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
      {
        "icon": gemini,
        "name": "Gemini"
      },
    ],
  },
  {
    logo: auth_logo,
    name: 'Auth',
    description: 'Auth App ทำขึ้นเพื่อแสดงทักษะในการทำระบบ login หรือ sign up การจัดการกับข้อมูลหลังยืนยันตัวตน และมี่การส่ง OTP เพื่อยืนยันและรีเซ็ตรหัส ใช้ React และ Node.js ในการพัฒนา',
    video: auth,
    feature: [
      {
        title: 'Validation',
        detail: 'การตรวจสอบข้อมูลก่อนเข้าสู่ระบบ',
      },
      {
        title: 'Verification',
        detail: 'การยืนยันตัวตนผู้ใช้งานเพื่อเพิ่มความปลอดภัย',
      },
      {
        title: 'Reset Password',
        detail: 'ระบบยืนยันเพื่อรีเซ็ตรหัสผ่าน',
      },
      {
        title: 'Responsive Design',
        detail: 'ใช้งานเว็บไซต์ได้อย่างราบรื่นกับทุกอุปกรณ์ ดีไซต์ที่ออกแบบมาเพื่อตอบสนองต่อขนาดหน้าจอต่างๆ',
      },
    ],
    tech: [
      {
        "icon": html,
        "name": "HTML"
      },
      {
        "icon": css,
        "name": "CSS"
      },
      {
        "icon": javaScript,
        "name": "JavaScript"
      },
      {
        "icon": react,
        "name": "React"
      },
      {
        "icon": tailwind,
        "name": "Tailwind CSS"
      },
      {
        "icon": reactRouter,
        "name": "React Router"
      },
      {
        "icon": axios,
        "name": "Axios"
      },
      {
        "icon": nodeJS,
        "name": "Node.js"
      },
      {
        "icon": mongoDB,
        "name": "MongoDB"
      },
      {
        "icon": expressJS,
        "name": "Express.js"
      },
    ],
  },
]